In [1]:
import pandas as pd

In [4]:
s1 = pd.Series([10,20,30,40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
s1.sum()

100

In [6]:
s1.mean()

25.0

In [14]:
s2 = pd.Series(['분식이','쏘니','홍길동','변사또'], index = ['하나','둘', '셋', '넷'], name = '출석부')
s2

하나    분식이
둘      쏘니
셋     홍길동
넷     변사또
Name: 출석부, dtype: object

In [15]:
s3 = pd.Series({'name':'김분식', 'age':30,'gender':'male', ' job':'분석가'})
s3

name       김분식
age         30
gender    male
 job       분석가
dtype: object

In [16]:
dic1 = {'name':'김분식','age':30, 'gender':'male', 'job':'분석가'}
pd.Series(dic1)

name       김분식
age         30
gender    male
job        분석가
dtype: object

In [17]:
s4 = pd.Series(['국어','수학','사회','과학'])
s4

0    국어
1    수학
2    사회
3    과학
dtype: object

In [18]:
s4[0]

'국어'

In [19]:
s3

name       김분식
age         30
gender    male
 job       분석가
dtype: object

In [20]:
s3['name']

'김분식'

In [21]:
s4[2:]

2    사회
3    과학
dtype: object

In [22]:
s4[:2]

0    국어
1    수학
dtype: object

In [23]:
s3

name       김분식
age         30
gender    male
 job       분석가
dtype: object

In [24]:
s3 == '분석가'

name      False
age       False
gender    False
 job       True
dtype: bool

In [25]:
s3[s3 == '분석가']

 job    분석가
dtype: object

# Dataframe

In [26]:
pd.DataFrame([10,20,30,40,50])

    0
0  10
1  20
2  30
3  40
4  50

In [27]:
pd.DataFrame([[10,20,30,40], ['철수','영희','분식','은희']])

    0   1   2   3
0  10  20  30  40
1  철수  영희  분식  은희

In [33]:
import pandas as pd

df1 = pd.DataFrame([
    [1000, '과자', '2019-12-31', '반품'],
    [2000, '음료', '2020-03-02', '정상'],
    [3000, '아이스크림', '2020-02-03', '정상'],
    [1000, '과자', '2019-12-31', '반품']],
columns = ['가격',' 종류', '판매일자','반품여부'])

In [34]:
df1

     가격     종류        판매일자 반품여부
0  1000     과자  2019-12-31   반품
1  2000     음료  2020-03-02   정상
2  3000  아이스크림  2020-02-03   정상
3  1000     과자  2019-12-31   반품

In [35]:
df1['가격']

0    1000
1    2000
2    3000
3    1000
Name: 가격, dtype: int64

In [36]:
df1['가격'].sum()

7000

In [37]:
df1['가격'].mean()

1750.0

In [38]:
df1[['가격']]

     가격
0  1000
1  2000
2  3000
3  1000